Repository: picolino/ATBSolutions
Catalog: ATB.DxfToNcConverter/Resources/Logging.*.resx
Languages: ru

# ProgramStarted
source: DxfToNcConverter started...
ru: DxfToNcConverter начинает работу...

# ProgramFinished
source: DxfToNcConverter finished.
ru: DxfToNcConverter завершил работу.

source: What-If mode activated.
ru: Режим Что-Если активирован.

source: Searching DXF files...
ru: Поиск DXF файлов...

# SearchDirectory
source: Search directory: '{0}'
ru: Директория для поиска: '{0}'

# FoundDxfFile
source: Found DXF file: '{0}'
ru: Найден DXF файл: '{0}'

# NoDxfFilesFound
source: There are no *.dxf files in working directory.
ru: В рабочей директории не найдено ни одного *.dxf файла.

source: Loading DXF files...
ru: Загрузка DXF файлов...

# DxfFileLoaded
source: File '{0}' successfully loaded.
ru: Файл '{0}' успешно загружен.

# ValidationDxfFiles
source: Validating DXF files...
ru: Валидация DXF файлов...

# DxfFileValid
source: DXF file '{0}' is valid.
ru: DXF файл '{0}' валиден.

source: Parsing DXF files...
ru: Чтение DXF файлов...

# ParsingDxfFile
source: Parsing DXF file: '{0}'...
ru: Чтение DXF файла: '{0}'...

# BiggestCircle
source: Biggest circle: Handle: '{0}'. Center: '{1}'. Radius: '{2}'.
ru: Самый большой круг: Идентификатор: '{0}'. Центр: '{1}'. Радиус: '{2}'.

# StartPointX
source: Start point: X: '{0}', Y: '{1}'.
ru: Начальная точка: X: '{0}', Y: '{1}'.

# EndPointX
source: End point: X: '{0}', Y: '{1}'.
ru: Конечная точка: X: '{0}', Y: '{1}'.

source: Parsing polylines...
ru: Чтение полилиний...

# ParsingPolyline
source: Parsing polyline: Handle: '{0}'. Vertexes count: '{1}'
ru: Чтение полилинии: Идентификатор: '{0}'. Количество вершин: '{1}'

# VertexExists
source: Vertex at position '{0}' already exists. Passing...
ru: Вершина в позиции '{0}' уже существует. Пропуск...

# DrillVertex
source: Drill vertex: X offset: '{0}'. Y offset: '{1}'. Drill time: '{2}'.
ru: Точка сверления: Отступ по X: '{0}'. Отступ по Y: '{1}'. Время сверления: '{2}'.

# ParsingDxfFileComplete
source: Parsing DXF file '{0}' complete.
ru: Чтение DXF файла '{0}' завершено.

source: Building NC programs...
ru: Построение NC программ...

source: Saving NC programs...
ru: Сохранение NC программ...

# NcFileSaved
source: NC file '{0}' saved.
ru: NC файл '{0}' сохранен.

# PressAnyKeyToExit
source: Press any button to exit...
ru: Нажмите любую кнопку для выхода...

source: Debug mode activated.
ru: Режим отладки активирован.
